[
    {
      "url": "https://www.linkedin.com/jobs/view/frontend-developer-at-delhivery-4361599737?_l=en",
      "job_posting_id": "4361599737",
      "job_title": "Frontend Developer",
      "company_name": "Delhivery",
      "company_id": "2312777",
      "job_location": "Gurugram, Haryana, India",
      "job_summary": "Designation: Sr Associate Role: FrontEnd Development Loc: Gurgaon(6-Days WFO) We are seeking a skilled and motivated Frontend Developer to join our dynamic team. The ideal candidate will have a strong passion for building high-quality web applications and tools, with a keen eye for detail and a commitment to delivering exceptional user experiences. Job Responsibilities: Create, build, and modify the Frontend/Web Application for the Team as per business requirements. Ensure the technical feasibility of UI/UX designs. Optimize applications for maximum speed and scalability. Implement responsive designs to ensure applications work seamlessly on various devices and screen sizes. Stay up-to-date with the latest industry trends and best practices in front-end development. Troubleshoot and resolve front-end issues and bugs. Write clean, maintainable, and well-documented code. Connect backend components to the web services by building web applications that are responsive and scalable Support the full-stack creative team through the complete lifecycle of the project Perform backend services accurately as per the high benchmark set by the leadership. Core Competencies: Expert knowledge of React Strong proficiency in React.js (Hooks, Components, Lifecycle) Solid understanding of JavaScript (ES6+), HTML5, and CSS3 Experience integrating REST APIs with frontend applications Working knowledge of Python Flask backend architecture Familiarity with API tools (Postman, Swagger, etc.) Experience with frontend build tools (Webpack, Vite, npm/yarn) Knowledge of responsive design and CSS frameworks (Bootstrap, Tailwind, Material UI) Understanding of version control systems (Git) Basic knowledge of authentication mechanisms (JWT, OAuth, Sessions) Knowledge of SQL /Mysql as integrated Database with Frontend Qualifications Experience as a full-stack Frontend developer Insight into SQL/NoSQL databases Angular / React Knowledge will be good to add. Project management and problem-solving skills 1+ years of experience in frontend development Hands-on experience with React in production applications Experience consuming APIs from Python Flask or similar backend frameworks Strong understanding of frontend architecture and API-driven development Show more Show less",
      "job_seniority_level": "Associate",
      "job_function": "Engineering",
      "job_employment_type": "Full-time",
      "job_industries": "Transportation, Logistics, Supply Chain and Storage",
      "company_url": "https://in.linkedin.com/company/delhivery?trk=public_jobs_topcard-org-name",
      "job_posted_time": "1 day ago",
      "job_num_applicants": 200,
      "discovery_input": {
        "location": "remote",
        "keyword": "React",
        "country": "",
        "time_range": "",
        "job_type": "",
        "experience_level": "",
        "remote": "",
        "company": "",
        "location_radius": ""
      },
      "apply_link": null,
      "country_code": null,
      "title_id": "3172",
      "company_logo": "https://media.licdn.com/dms/image/v2/D560BAQFHOFbzc8eTug/company-logo_100_100/B56ZqQnVlMG0AQ-/0/1763362822878/delhivery_logo?e=2147483647&v=beta&t=dQcfSRYS9a6bB2sRa2RJoyMFoDxAKSK39epnKT4djZs",
      "job_posted_date": "2026-01-14T21:38:39.282Z",
      "job_poster": null,
      "application_availability": true,
      "job_description_formatted": "<section class=\"show-more-less-html\" data-max-lines=\"5\">\n        <div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <p><strong>Designation: Sr Associate</strong></p><p><strong>Role: FrontEnd Development</strong></p><p><strong>Loc: Gurgaon(6-Days WFO)</strong></p><p><br></p><p>We are seeking a skilled and motivated Frontend Developer to join our dynamic team. The ideal candidate will have a strong passion for building high-quality web applications and tools, with a keen eye for detail and a commitment to delivering exceptional user experiences.</p><p><br></p><p><strong><u>Job Responsibilities:</u></strong></p><ul><li>Create, build, and modify the Frontend/Web Application for the Team as per business requirements.</li><li>Ensure the technical feasibility of UI/UX designs.</li><li>Optimize applications for maximum speed and scalability.</li><li>Implement responsive designs to ensure applications work seamlessly on various devices and screen sizes.</li><li>Stay up-to-date with the latest industry trends and best practices in front-end development.</li><li>Troubleshoot and resolve front-end issues and bugs.</li><li>Write clean, maintainable, and well-documented code.</li><li>Connect backend components to the web services by building web applications that are responsive and scalable</li><li>Support the full-stack creative team through the complete lifecycle of the project</li><li>Perform backend services accurately as per the high benchmark set by the leadership.</li></ul><p><br></p><p><strong><u>Core Competencies:</u></strong></p><ul><li>Expert knowledge of React</li><li>Strong proficiency in React.js (Hooks, Components, Lifecycle)</li><li>Solid understanding of JavaScript (ES6+), HTML5, and CSS3</li><li>Experience integrating REST APIs with frontend applications</li><li>Working knowledge of Python Flask backend architecture</li><li>Familiarity with API tools (Postman, Swagger, etc.)</li><li>Experience with frontend build tools (Webpack, Vite, npm/yarn)</li><li>Knowledge of responsive design and CSS frameworks (Bootstrap, Tailwind, Material UI)</li><li>Understanding of version control systems (Git)</li><li>Basic knowledge of authentication mechanisms (JWT, OAuth, Sessions)</li><li>Knowledge of SQL /Mysql as integrated Database with Frontend</li></ul><p><br></p><p><strong>Qualifications</strong></p><ul><li>Experience as a full-stack Frontend developer</li><li>Insight into SQL/NoSQL databases</li><li>Angular / React Knowledge will be good to add.</li><li>Project management and problem-solving skills</li><li><strong>1+ years</strong> of experience in frontend development</li><li>Hands-on experience with <strong>React</strong> in production applications</li><li>Experience consuming APIs from <strong>Python Flask</strong> or similar backend frameworks</li><li>Strong understanding of frontend architecture and API-driven development</li></ul><p><br></p>\n        </div>\n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--more\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\" aria-label=\"Show more\" aria-expanded=\"false\">\n<!---->\n        \n            Show more\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/cyolgscd0imw2ldqppkrb84vo\"></icon>\n    </button>\n  \n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--less\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\" aria-label=\"Show less\" aria-expanded=\"true\">\n<!---->\n        \n            Show less\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/4chtt12k98xwnba1nimld2oyg\"></icon>\n    </button>\n  \n<!---->    </section>",
      "base_salary": null,
      "salary_standards": null,
      "is_easy_apply": false,
      "timestamp": "2026-01-15T21:38:39.294Z",
      "input": {
        "url": "https://in.linkedin.com/jobs/view/frontend-developer-at-delhivery-4361599737",
        "discovery_input": {
          "location": "remote",
          "keyword": "React",
          "country": "",
          "time_range": "",
          "job_type": "",
          "experience_level": "",
          "remote": ""
        }
      }
    },
    {
      "url": "https://www.linkedin.com/jobs/view/react-frontend-at-virtusa-4345217003?_l=en",
      "job_posting_id": "4345217003",
      "job_title": "React Frontend",
      "company_name": "Virtusa",
      "company_id": "5140",
      "job_location": "Mumbai Metropolitan Region",
      "job_summary": "The Successful Candidate Should Be Capable Of Driving the strategy and the modernisation of the front ends Working with the Investec Design System to ensure adoption and contribution to the design system Accountability for technical delivery aspects on assigned projects through Full Development Life Cycle Provide systems analysis skills including technical specifications Develop new functionality on existing systems Lean / agile development mind set Act with integrity and embrace the philosophy of treating clients fairly Developing systems for both high availability and scalability i.e. architecting for failure Integrating and communicating in a technical environment Developing using industry best practice & established RESTful design principles (when applicable) Working in a software development team environment using source control and continuous integration Designing and maintaining a microservices architecture following RESTful principles (when applicable) Applying problem solving skills to technical issues Focus on knowledge sharing, pairing, team support and joint problem solving to drive communal learning Testable, clean, performance-oriented code that the team can support Technical knowledge & experience Core Web Technologies: HTML; CSS; JavaScript; TypeScript; Front-End Frameworks and Libraries: React; CSS; SASS Version Control: Git Responsive Design: Ensuring web pages adapt well to different screen sizes and devices. Strong knowledge of accessibility and ensuring web pages are usable by people with disabilities. Problem-solving and communication skills: debugging and collaborating with other developers and designers. Able to communicate well to various technical and non-technical audiences. Experience working with design systems Design systems – using and contributing to them Experience working with UI Grid systems Show more Show less",
      "job_seniority_level": "Mid-Senior level",
      "job_function": "Other",
      "job_employment_type": "Full-time",
      "job_industries": "IT Services and IT Consulting",
      "company_url": "https://www.linkedin.com/company/virtusa?trk=public_jobs_topcard-org-name",
      "job_posted_time": "5 days ago",
      "job_num_applicants": 200,
      "discovery_input": {
        "location": "remote",
        "keyword": "React",
        "country": "",
        "time_range": "",
        "job_type": "",
        "experience_level": "",
        "remote": "",
        "company": "",
        "location_radius": ""
      },
      "apply_link": null,
      "country_code": null,
      "title_id": null,
      "company_logo": "https://media.licdn.com/dms/image/v2/D4D0BAQE1wyZ0gd_P_w/company-logo_100_100/B4DZmf03PuJMAY-/0/1759323061531/virtusa_logo?e=2147483647&v=beta&t=BX2oukfWW-ynMINuDRbCIlfgg5xRn0BoZf9Mk-TS1t4",
      "job_posted_date": "2026-01-10T21:38:39.505Z",
      "job_poster": null,
      "application_availability": true,
      "job_description_formatted": "<section class=\"show-more-less-html\" data-max-lines=\"5\">\n        <div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <strong>The Successful Candidate Should Be Capable Of<br><br></strong><ul><li> Driving the strategy and the modernisation of the front ends</li><li> Working with the Investec Design System to ensure adoption and contribution to the design system</li><li> Accountability for technical delivery aspects on assigned projects through Full Development Life Cycle</li><li> Provide systems analysis skills including technical specifications</li><li> Develop new functionality on existing systems</li><li> Lean / agile development mind set</li><li> Act with integrity and embrace the philosophy of treating clients fairly</li><li> Developing systems for both high availability and scalability i.e. architecting for failure</li><li> Integrating and communicating in a technical environment</li><li> Developing using industry best practice &amp; established RESTful design principles (when applicable)</li><li> Working in a software development team environment using source control and continuous integration</li><li> Designing and maintaining a microservices architecture following RESTful principles (when applicable)</li><li> Applying problem solving skills to technical issues</li><li> Focus on knowledge sharing, pairing, team support and joint problem solving to drive communal learning<br><br></li></ul>Testable, clean, performance-oriented code that the team can support<br><br>Technical knowledge &amp; experience<br><br><ul><li> Core Web Technologies: HTML; CSS; JavaScript; TypeScript;</li><li> Front-End Frameworks and Libraries: React; CSS; SASS</li><li> Version Control: Git</li><li> Responsive Design: Ensuring web pages adapt well to different screen sizes and devices.</li><li> Strong knowledge of accessibility and ensuring web pages are usable by people with disabilities.</li><li> Problem-solving and communication skills: debugging and collaborating with other developers and designers. Able to communicate well to various technical and non-technical audiences.</li><li> Experience working with design systems Design systems &#x2013; using and contributing to them</li><li> Experience working with UI Grid systems</li></ul>\n        </div>\n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--more\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\" aria-label=\"Show more\" aria-expanded=\"false\">\n<!---->\n        \n            Show more\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/cyolgscd0imw2ldqppkrb84vo\"></icon>\n    </button>\n  \n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--less\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\" aria-label=\"Show less\" aria-expanded=\"true\">\n<!---->\n        \n            Show less\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/4chtt12k98xwnba1nimld2oyg\"></icon>\n    </button>\n  \n<!---->    </section>",
      "base_salary": null,
      "salary_standards": null,
      "is_easy_apply": false,
      "timestamp": "2026-01-15T21:38:39.516Z",
      "input": {
        "url": "https://in.linkedin.com/jobs/view/react-frontend-at-virtusa-4345217003",
        "discovery_input": {
          "location": "remote",
          "keyword": "React",
          "country": "",
          "time_range": "",
          "job_type": "",
          "experience_level": "",
          "remote": ""
        }
      }
    },
    {
      "url": "https://www.linkedin.com/jobs/view/frontend-engineer-react%2B-javascript-at-apple-4357638640?_l=en",
      "job_posting_id": "4357638640",
      "job_title": "Frontend Engineer (React+ Javascript)",
      "company_name": "Apple",
      "company_id": "162479",
      "job_location": "Bengaluru, Karnataka, India",
      "job_summary": "Summary The people here at Apple don't just build products—they craft the kind of wonder that has revolutionized entire industries. It's the diversity of those people and their ideas that encourage the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it!nnImagine what you could do here! At Apple, great ideas have a way of becoming great products, services, and customer experiences quickly. Bring passion and dedication to your job, and there is no telling what you could accomplish here. Do you want to be part of a team that builds cutting-edge software services, a team that continually innovates and is proud to make a difference? If so, bring your passion and talent, and come join us to be part of something big and amazing.nnWe are seeking an experienced Frontend Engineer to join our team and contribute to the development of dynamic, high-traffic web applications. As part of the engineering team, you will create responsive and accessible web applications that provide a seamless user experience across various devices. This role involves close collaboration with design, product, and back-end teams to implement innovative solutions and deliver exceptional customer experiences. Description Build and maintain scalable, high-performance web applications that deliver seamless user experiences.nCollaborate with cross-functional teams including designers, product managers, and backend engineers to implement responsive, accessible, and user-centric interfaces.nWrite clean, modular, and reusable code using HTML, CSS, JavaScript (ES6+), and modern frontend frameworks (React, Vue.js, or Angular).nOptimize applications for speed, scalability, and engagement, ensuring cross-browser compatibility and adherence to security and accessibility standards.nConduct peer code reviews, debug performance bottlenecks, and resolve technical issues.nStay current with emerging web technologies and contribute to improving the frontend architecture. Minimum Qualifications Bachelor’s degree in Computer Science, Software Engineering, or a related field, or equivalent practical experience.n4+ years of experience in frontend development, particularly with high-traffic, consumer-facing applications aligning with WCAG Accessibility Guidelines.nProficiency in HTML5, CSS3, JavaScript, Typescript and experience with modern frameworks (React, Vue.js, or Angular) and tools such as Redux, Web Components, WebRTC, Rush, Webpack, ESLint.nSolid understanding of web performance optimization, cross-browser compatibility, and responsive design. Preferred Qualifications Experience with RESTful APIs, GraphQL, and server-side rendering (e.g., Next.js, Nuxt.js).nFamiliarity with build tools, version control (Git), and CI/CD pipelines.nUnderstanding of accessibility standards (WCAG), mobile-first principles, and design fidelity.nStrong problem-solving skills, attention to detail, and a passion for creating pixel-perfect, user-friendly interfaces. Show more Show less",
      "job_seniority_level": "Mid-Senior level",
      "job_function": "Engineering and Information Technology",
      "job_employment_type": "Full-time",
      "job_industries": "Computers and Electronics Manufacturing",
      "company_url": "https://www.linkedin.com/company/apple?trk=public_jobs_topcard-org-name",
      "job_posted_time": "3 hours ago",
      "job_num_applicants": 200,
      "discovery_input": {
        "location": "remote",
        "keyword": "React",
        "country": "",
        "time_range": "",
        "job_type": "",
        "experience_level": "",
        "remote": "",
        "company": "",
        "location_radius": ""
      },
      "apply_link": null,
      "country_code": null,
      "title_id": "3172",
      "company_logo": "https://media.licdn.com/dms/image/v2/C560BAQHdAaarsO-eyA/company-logo_100_100/company-logo_100_100/0/1630637844948/apple_logo?e=2147483647&v=beta&t=p0JNmv2WB0EMMQgvzl9R8TaXgzEaDraGS4MWR0IawjQ",
      "job_posted_date": "2026-01-15T18:38:39.617Z",
      "job_poster": null,
      "application_availability": true,
      "job_description_formatted": "<section class=\"show-more-less-html\" data-max-lines=\"5\">\n        <div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <strong>Summary<br><br></strong>The people here at Apple don&apos;t just build products&#x2014;they craft the kind of wonder that has revolutionized entire industries. It&apos;s the diversity of those people and their ideas that encourage the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it!nnImagine what you could do here! At Apple, great ideas have a way of becoming great products, services, and customer experiences quickly. Bring passion and dedication to your job, and there is no telling what you could accomplish here. Do you want to be part of a team that builds cutting-edge software services, a team that continually innovates and is proud to make a difference? If so, bring your passion and talent, and come join us to be part of something big and amazing.nnWe are seeking an experienced Frontend Engineer to join our team and contribute to the development of dynamic, high-traffic web applications. As part of the engineering team, you will create responsive and accessible web applications that provide a seamless user experience across various devices. This role involves close collaboration with design, product, and back-end teams to implement innovative solutions and deliver exceptional customer experiences.<br><br><strong>Description<br><br></strong>Build and maintain scalable, high-performance web applications that deliver seamless user experiences.nCollaborate with cross-functional teams including designers, product managers, and backend engineers to implement responsive, accessible, and user-centric interfaces.nWrite clean, modular, and reusable code using HTML, CSS, JavaScript (ES6+), and modern frontend frameworks (React, Vue.js, or Angular).nOptimize applications for speed, scalability, and engagement, ensuring cross-browser compatibility and adherence to security and accessibility standards.nConduct peer code reviews, debug performance bottlenecks, and resolve technical issues.nStay current with emerging web technologies and contribute to improving the frontend architecture.<br><br><strong>Minimum Qualifications<br><br></strong>Bachelor&#x2019;s degree in Computer Science, Software Engineering, or a related field, or equivalent practical experience.n4+ years of experience in frontend development, particularly with high-traffic, consumer-facing applications aligning with WCAG Accessibility Guidelines.nProficiency in HTML5, CSS3, JavaScript, Typescript and experience with modern frameworks (React, Vue.js, or Angular) and tools such as Redux, Web Components, WebRTC, Rush, Webpack, ESLint.nSolid understanding of web performance optimization, cross-browser compatibility, and responsive design.<br><br><strong>Preferred Qualifications<br><br></strong>Experience with RESTful APIs, GraphQL, and server-side rendering (e.g., Next.js, Nuxt.js).nFamiliarity with build tools, version control (Git), and CI/CD pipelines.nUnderstanding of accessibility standards (WCAG), mobile-first principles, and design fidelity.nStrong problem-solving skills, attention to detail, and a passion for creating pixel-perfect, user-friendly interfaces.<br><br>\n        </div>\n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--more\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\" aria-label=\"Show more\" aria-expanded=\"false\">\n<!---->\n        \n            Show more\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/cyolgscd0imw2ldqppkrb84vo\"></icon>\n    </button>\n  \n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--less\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\" aria-label=\"Show less\" aria-expanded=\"true\">\n<!---->\n        \n            Show less\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/4chtt12k98xwnba1nimld2oyg\"></icon>\n    </button>\n  \n<!---->    </section>",
      "base_salary": null,
      "salary_standards": null,
      "is_easy_apply": false,
      "timestamp": "2026-01-15T21:38:39.629Z",
      "input": {
        "url": "https://in.linkedin.com/jobs/view/frontend-engineer-react%2B-javascript-at-apple-4357638640",
        "discovery_input": {
          "location": "remote",
          "keyword": "React",
          "country": "",
          "time_range": "",
          "job_type": "",
          "experience_level": "",
          "remote": ""
        }
      }
    },
    {
      "url": "https://www.linkedin.com/jobs/view/sde-1-frontend-at-jar-4361134511?_l=en",
      "job_posting_id": "4361134511",
      "job_title": "SDE 1 - Frontend",
      "company_name": "Jar",
      "company_id": "71740235",
      "job_location": "Bengaluru, Karnataka, India",
      "job_summary": "About Us Jar is India’s leading Daily Saving app that helps people build strong saving habits—one small step at a time. Our goal is to make saving simple, rewarding, and truly life-changing. Founded in 2021 by Misbah Ashraf and Nishchay AG, Jar is a Bengaluru-based startup with one simple belief: saving a little every day in 24K Digital Gold can truly transform your future. Today, 20 million+ Indians trust Jar as their saving partner. With flexible saving options—Daily, Weekly, Monthly, and Instant Saving—we have made it easy for everyone to save in their own way and withdraw anytime. We are one of the leaders in UPI autopay transactions, crossing more than 1 million transactions per day. In 2023, we expanded our vision with Nek, our jewelry brand crafted to bring together luxury and affordability, it has since surpassed ₹100 crore in revenue. We have a big dream of bringing “Har Ghar Sona”. Small, consistent savings are just the start. We’re here to walk alongside our users, helping Indians secure their financial future every step of the way. Backed by Tiger Global Management, Arkam Ventures, and WEH Ventures, among others, we have raised $50 million+ in funding. In January 2025, we hit a huge milestone of becoming profitable. Now, we’re charging ahead, focused on sustainable growth and scaling impact. And this is just the beginning! What’s the role? We're looking for a Frontend Engineer to build delightful, performant user experiences that help millions of Indians save and invest in digital gold. You'll work with React and modern web technologies to create intuitive interfaces in a fast-paced fintech startup environment. Our Tech Stack Frontend: React.js, Next.js, TypeScript, TailwindCSS Backend: Node.js, REST APIs Tools & Infra: Git, Docker, AWS/GCP, CI/CD pipelines What will be your responsibilities? Develop and maintain user-facing web applications using React.js, Next.js, and TypeScript Collaborate with design, product, and backend teams to deliver pixel-perfect, performant, and responsive experiences Translate Figma/mockups into clean, maintainable, and reusable UI components Integrate frontend systems with RESTful APIs and backend services Optimize performance for scalability, accessibility, and smooth cross-browser behavior Participate in code reviews, ensuring high-quality, readable, and consistent code Continuously improve frontend architecture, developer experience, and UI reliability through testing and best practices Stay up to date with emerging frontend technologies and contribute ideas to enhance our tech stack What’s required from you? 1–3 years of hands-on experience in frontend development Strong JavaScript fundamentals and proficiency with TypeScript Experience building scalable, modular web applications using React.js (Next.js is a plus) Strong grasp of HTML5, CSS3, and modern styling frameworks such as TailwindCSS Good understanding of web performance optimization, responsive design, and cross-browser compatibility Proficiency with Git and collaborative development workflows Bachelor’s degree in Computer Science or a related field (or equivalent experience) Excellent problem-solving and communication skills with a team-first attitude Nice to Have: Experience with form management libraries (e.g., React Hook Form, Formik) Familiarity with frontend testing tools (Jest, React Testing Library, Cypress) Understanding of CI/CD, code-splitting, and frontend build optimization Experience working in a startup or fast-paced environment Contributions to open-source or personal frontend projects What makes us different? We’re not just building a product—we’re shaping the future of savings in India. We seek people who bring passion, energy, and fresh ideas to help us make that happen. Experience matters, but we are a potential first organisation. We move fast, learn from our mistakes, and take bold risks to solve problems that haven’t been attempted before. If you’re excited about working in an environment where people inspire and truly support each other, you’ve found the right fit. What do we stand for? The five values that we live by: Passion: At Jar, we strive to create an environment where people love what they do, are motivated and equipped to do their best work. Equality: We bring diverse skills, ideas, and experiences to the table, supporting and challenging each other across teams to create something bigger than ourselves. Growth: When our people grow, Jar grows. We create opportunities for learning, development, and meaningful impact. Accountability: The core of our work ethic is taking ownership of our work, showing initiative, and having the freedom to ask questions. Consistency: We believe in doing the right things consistently. Big change doesn’t happen overnight, it’s built one step at a time. Join us and let’s build something amazing together! What employee benefits do we have? Glad you asked! Among other things, we have Medical Insurance for employees and their families ESOPs allocation Pluxee meal card Swish club card for exclusive employee discounts Advance salary plans Relocation assistance L&D programmes Powered by JazzHR 9DnmeywN25 Show more Show less",
      "job_seniority_level": "Entry level",
      "job_function": "Engineering and Information Technology",
      "job_employment_type": "Full-time",
      "job_industries": "Internet Publishing",
      "company_url": "https://in.linkedin.com/company/jarapp?trk=public_jobs_topcard-org-name",
      "job_posted_time": "3 days ago",
      "job_num_applicants": 200,
      "discovery_input": {
        "location": "remote",
        "keyword": "React",
        "country": "",
        "time_range": "",
        "job_type": "",
        "experience_level": "",
        "remote": "",
        "company": "",
        "location_radius": ""
      },
      "apply_link": null,
      "country_code": null,
      "title_id": "9",
      "company_logo": "https://media.licdn.com/dms/image/v2/D560BAQFstciXrweNeg/company-logo_100_100/B56ZlSM5hGI8AQ-/0/1758020737797/jarapp_logo?e=2147483647&v=beta&t=YkGKFFsUOnbT39GR5VV06ozvVTWHT6TTwtiUugQ08uU",
      "job_posted_date": "2026-01-12T21:38:40.520Z",
      "job_poster": null,
      "application_availability": true,
      "job_description_formatted": "<section class=\"show-more-less-html\" data-max-lines=\"5\">\n        <div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <strong>About Us<br><br></strong>Jar is India&#x2019;s leading Daily Saving app that helps people build strong saving habits&#x2014;one small step at a time. Our goal is to make saving simple, rewarding, and truly life-changing. Founded in 2021 by Misbah Ashraf and Nishchay AG, Jar is a Bengaluru-based startup with one simple belief: saving a little every day in 24K Digital Gold can truly transform your future.<br><br>Today, 20 million+ Indians trust Jar as their saving partner. With flexible saving options&#x2014;Daily, Weekly, Monthly, and Instant Saving&#x2014;we have made it easy for everyone to save in their own way and withdraw anytime. We are one of the leaders in UPI autopay transactions, crossing more than 1 million transactions per day. In 2023, we expanded our vision with Nek, our jewelry brand crafted to bring together luxury and affordability, it has since surpassed &#x20B9;100 crore in revenue.<br><br>We have a big dream of bringing &#x201C;Har Ghar Sona&#x201D;. Small, consistent savings are just the start. We&#x2019;re here to walk alongside our users, helping Indians secure their financial future every step of the way.<br><br>Backed by Tiger Global Management, Arkam Ventures, and WEH Ventures, among others, we have raised $50 million+ in funding. In January 2025, we hit a huge milestone of becoming profitable. Now, we&#x2019;re charging ahead, focused on sustainable growth and scaling impact.<br><br>And this is just the beginning!<br><br><strong>What&#x2019;s the role?<br><br></strong>We&apos;re looking for a Frontend Engineer to build delightful, performant user experiences that help millions of Indians save and invest in digital gold. You&apos;ll work with React and modern web technologies to create intuitive interfaces in a fast-paced fintech startup environment.<br><br><strong>Our Tech Stack<br><br></strong><ul><li>Frontend: React.js, Next.js, TypeScript, TailwindCSS</li><li>Backend: Node.js, REST APIs</li><li>Tools &amp; Infra: Git, Docker, AWS/GCP, CI/CD pipelines<br><br></li></ul><strong>What will be your responsibilities?<br><br></strong><ul><li>Develop and maintain user-facing web applications using React.js, Next.js, and TypeScript</li><li>Collaborate with design, product, and backend teams to deliver pixel-perfect, performant, and responsive experiences</li><li>Translate Figma/mockups into clean, maintainable, and reusable UI components</li><li>Integrate frontend systems with RESTful APIs and backend services</li><li>Optimize performance for scalability, accessibility, and smooth cross-browser behavior</li><li>Participate in code reviews, ensuring high-quality, readable, and consistent code</li><li>Continuously improve frontend architecture, developer experience, and UI reliability through testing and best practices</li><li>Stay up to date with emerging frontend technologies and contribute ideas to enhance our tech stack<br><br></li></ul><strong>What&#x2019;s required from you?<br><br></strong><ul><li>1&#x2013;3 years of hands-on experience in frontend development</li><li>Strong JavaScript fundamentals and proficiency with TypeScript</li><li>Experience building scalable, modular web applications using React.js (Next.js is a plus)</li><li>Strong grasp of HTML5, CSS3, and modern styling frameworks such as TailwindCSS</li><li>Good understanding of web performance optimization, responsive design, and cross-browser compatibility</li><li>Proficiency with Git and collaborative development workflows</li><li>Bachelor&#x2019;s degree in Computer Science or a related field (or equivalent experience)</li><li>Excellent problem-solving and communication skills with a team-first attitude<br><br></li></ul><strong>Nice to Have: <br><br></strong><ul><li>Experience with form management libraries (e.g., React Hook Form, Formik)</li><li>Familiarity with frontend testing tools (Jest, React Testing Library, Cypress)</li><li>Understanding of CI/CD, code-splitting, and frontend build optimization</li><li>Experience working in a startup or fast-paced environment</li><li>Contributions to open-source or personal frontend projects<br><br></li></ul><strong>What makes us different?<br><br></strong>We&#x2019;re not just building a product&#x2014;we&#x2019;re shaping the future of savings in India. We seek people who bring passion, energy, and fresh ideas to help us make that happen. Experience matters, but we are a potential first organisation. We move fast, learn from our mistakes, and take bold risks to solve problems that haven&#x2019;t been attempted before. If you&#x2019;re excited about working in an environment where people inspire and truly support each other, you&#x2019;ve found the right fit.<br><br><strong>What do we stand for?<br><br></strong>The five values that we live by:<br><br><strong>Passion:</strong> At Jar, we strive to create an environment where people love what they do, are motivated and equipped to do their best work.<br><br><strong>Equality:</strong> We bring diverse skills, ideas, and experiences to the table, supporting and challenging each other across teams to create something bigger than ourselves.<br><br><strong>Growth:</strong> When our people grow, Jar grows. We create opportunities for learning, development, and meaningful impact.<br><br><strong>Accountability:</strong> The core of our work ethic is taking ownership of our work, showing initiative, and having the freedom to ask questions.<br><br><strong>Consistency: </strong>We believe in doing the right things consistently. Big change doesn&#x2019;t happen overnight, it&#x2019;s built one step at a time.<br><br>Join us and let&#x2019;s build something amazing together!<br><br><strong>What employee benefits do we have?<br><br></strong>Glad you asked! Among other things, we have<br><br><ul><li>Medical Insurance for employees and their families</li><li>ESOPs allocation</li><li>Pluxee meal card</li><li>Swish club card for exclusive employee discounts </li><li>Advance salary plans</li><li>Relocation assistance</li><li>L&amp;D programmes<br><br></li></ul>Powered by JazzHR<br><br>9DnmeywN25\n        </div>\n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--more\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\" aria-label=\"Show more\" aria-expanded=\"false\">\n<!---->\n        \n            Show more\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/cyolgscd0imw2ldqppkrb84vo\"></icon>\n    </button>\n  \n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--less\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\" aria-label=\"Show less\" aria-expanded=\"true\">\n<!---->\n        \n            Show less\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/4chtt12k98xwnba1nimld2oyg\"></icon>\n    </button>\n  \n<!---->    </section>",
      "base_salary": null,
      "salary_standards": null,
      "is_easy_apply": true,
      "timestamp": "2026-01-15T21:38:40.535Z",
      "input": {
        "url": "https://in.linkedin.com/jobs/view/sde-1-frontend-at-jar-4361134511",
        "discovery_input": {
          "location": "remote",
          "keyword": "React",
          "country": "",
          "time_range": "",
          "job_type": "",
          "experience_level": "",
          "remote": ""
        }
      }
    },
    {
      "url": "https://www.linkedin.com/jobs/view/react-front-end-at-virtusa-4345842934?_l=en",
      "job_posting_id": "4345842934",
      "job_title": "React Front End",
      "company_name": "Virtusa",
      "company_id": "5140",
      "job_location": "Mumbai Metropolitan Region",
      "job_summary": "The Successful Candidate Should Be Capable Of Driving the strategy and the modernisation of the front ends Working with the Investec Design System to ensure adoption and contribution to the design system Accountability for technical delivery aspects on assigned projects through Full Development Life Cycle Provide systems analysis skills including technical specifications Develop new functionality on existing systems Lean / agile development mind set Act with integrity and embrace the philosophy of treating clients fairly Developing systems for both high availability and scalability i.e. architecting for failure Integrating and communicating in a technical environment Developing using industry best practice & established RESTful design principles (when applicable) Working in a software development team environment using source control and continuous integration Designing and maintaining a microservices architecture following RESTful principles (when applicable) Applying problem solving skills to technical issues Focus on knowledge sharing, pairing, team support and joint problem solving to drive communal learning Testable, clean, performance-oriented code that the team can support Technical knowledge & experience Core Web Technologies: HTML; CSS; JavaScript; TypeScript; Front-End Frameworks and Libraries: React; CSS; SASS Version Control: Git Responsive Design: Ensuring web pages adapt well to different screen sizes and devices. Strong knowledge of accessibility and ensuring web pages are usable by people with disabilities. Problem-solving and communication skills: debugging and collaborating with other developers and designers. Able to communicate well to various technical and non-technical audiences. Experience working with design systems Design systems – using and contributing to them Experience working with UI Grid systems Show more Show less",
      "job_seniority_level": "Mid-Senior level",
      "job_function": "Other",
      "job_employment_type": "Full-time",
      "job_industries": "IT Services and IT Consulting",
      "company_url": "https://www.linkedin.com/company/virtusa?trk=public_jobs_topcard-org-name",
      "job_posted_time": "2 days ago",
      "job_num_applicants": 200,
      "discovery_input": {
        "location": "remote",
        "keyword": "React",
        "country": "",
        "time_range": "",
        "job_type": "",
        "experience_level": "",
        "remote": "",
        "company": "",
        "location_radius": ""
      },
      "apply_link": "https://www.virtusa.com/careers/in/mumbai/web-app-engineering/react-front-end/creq241812",
      "country_code": null,
      "title_id": null,
      "company_logo": "https://media.licdn.com/dms/image/v2/D4D0BAQE1wyZ0gd_P_w/company-logo_100_100/B4DZmf03PuJMAY-/0/1759323061531/virtusa_logo?e=2147483647&v=beta&t=BX2oukfWW-ynMINuDRbCIlfgg5xRn0BoZf9Mk-TS1t4",
      "job_posted_date": "2026-01-13T21:38:41.249Z",
      "job_poster": null,
      "application_availability": true,
      "job_description_formatted": "<section class=\"show-more-less-html\" data-max-lines=\"5\">\n        <div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <strong>The Successful Candidate Should Be Capable Of<br><br></strong><ul><li> Driving the strategy and the modernisation of the front ends</li><li> Working with the Investec Design System to ensure adoption and contribution to the design system</li><li> Accountability for technical delivery aspects on assigned projects through Full Development Life Cycle</li><li> Provide systems analysis skills including technical specifications</li><li> Develop new functionality on existing systems</li><li> Lean / agile development mind set</li><li> Act with integrity and embrace the philosophy of treating clients fairly</li><li> Developing systems for both high availability and scalability i.e. architecting for failure</li><li> Integrating and communicating in a technical environment</li><li> Developing using industry best practice &amp; established RESTful design principles (when applicable)</li><li> Working in a software development team environment using source control and continuous integration</li><li> Designing and maintaining a microservices architecture following RESTful principles (when applicable)</li><li> Applying problem solving skills to technical issues</li><li> Focus on knowledge sharing, pairing, team support and joint problem solving to drive communal learning<br><br></li></ul>Testable, clean, performance-oriented code that the team can support<br><br>Technical knowledge &amp; experience<br><br><ul><li> Core Web Technologies: HTML; CSS; JavaScript; TypeScript;</li><li> Front-End Frameworks and Libraries: React; CSS; SASS</li><li> Version Control: Git</li><li> Responsive Design: Ensuring web pages adapt well to different screen sizes and devices.</li><li> Strong knowledge of accessibility and ensuring web pages are usable by people with disabilities.</li><li> Problem-solving and communication skills: debugging and collaborating with other developers and designers. Able to communicate well to various technical and non-technical audiences.</li><li> Experience working with design systems Design systems &#x2013; using and contributing to them</li><li> Experience working with UI Grid systems</li></ul>\n        </div>\n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--more\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\" aria-label=\"Show more\" aria-expanded=\"false\">\n<!---->\n        \n            Show more\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/cyolgscd0imw2ldqppkrb84vo\"></icon>\n    </button>\n  \n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--less\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\" aria-label=\"Show less\" aria-expanded=\"true\">\n<!---->\n        \n            Show less\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/4chtt12k98xwnba1nimld2oyg\"></icon>\n    </button>\n  \n<!---->    </section>",
      "base_salary": null,
      "salary_standards": null,
      "is_easy_apply": false,
      "timestamp": "2026-01-15T21:38:41.328Z",
      "input": {
        "url": "https://in.linkedin.com/jobs/view/react-front-end-at-virtusa-4345842934",
        "discovery_input": {
          "location": "remote",
          "keyword": "React",
          "country": "",
          "time_range": "",
          "job_type": "",
          "experience_level": "",
          "remote": ""
        }
      }
    },
    {
      "url": "https://www.linkedin.com/jobs/view/frontend-developer-at-wipro-4361222118?_l=en",
      "job_posting_id": "4361222118",
      "job_title": "FRONTEND DEVELOPER",
      "company_name": "Wipro",
      "company_id": "1318",
      "job_location": "Pune, Maharashtra, India",
      "job_summary": "Job description: Job Description Role Purpose The purpose of this role is to design, develop and troubleshoot solutions/ designs/ models/ simulations on various softwares as per clientÃƒÂ¢Ã‚Â€Ã‚Â™s/ project requirements ͏ Do 1. Design and Develop solutions as per clientÃƒÂ¢Ã‚Â€Ã‚Â™s specifications Work on different softwares like CAD, CAE to develop appropriate models as per the project plan/ customer requirements Test the protype and designs produced on the softwares and check all the boundary conditions (impact analysis, stress analysis etc) Produce specifications and determine operational feasibility by integrating software components into a fully functional software system Create a prototype as per the engineering drawings & outline CAD model is prepared Perform failure effect mode analysis (FMEA) for any new requirements received from the client Provide optimized solutions to the client by running simulations in virtual environment Ensure software is updated with latest features to make it cost effective for the client Enhance applications/ solutions by identifying opportunities for improvement, making recommendations and designing and implementing systems Follow industry standard operating procedures for various processes and systems as per the client requirement while modeling a solution on the software ͏ 2. Provide customer support and problem solving from time to time Perform defect fixing raised by the client or software integration team while solving the tickets raised Develop software verification plans and quality assurance procedures for the customer Troubleshoot, debug and upgrade existing systems on time & with minimum latency and maximum efficiency Deploy programs and evaluate user feedback for adequate resolution with customer satisfaction Comply with project plans and industry standards ͏ 3. Ensure reporting & documentation for the client Ensure weekly, monthly status reports for the clients as per requirements Maintain documents and create a repository of all design changes, recommendations etc Maintain time-sheets for the clients Providing written knowledge transfer/ history of the project ͏ Deliver No. Performance Parameter Measure 1.Design and develop solutionsAdherence to project plan/ schedule, 100% error free on boarding & implementation, throughput %2.Quality & CSATOn-Time Delivery, minimum corrections, first time right, no major defects post production, 100% compliance of bi-directional traceability matrix, completion of assigned certifications for skill upgradation3.MIS & Reporting100% on time MIS & report generation Experience: 5-8 Years . Reinvent your world. We are building a modern Wipro. We are an end-to-end digital transformation partner with the boldest ambitions. To realize them, we need people inspired by reinvention. Of yourself, your career, and your skills. We want to see the constant evolution of our business and our industry. It has always been in our DNA - as the world around us changes, so do we. Join a business powered by purpose and a place that empowers you to design your own reinvention. Show more Show less",
      "job_seniority_level": "Entry level",
      "job_function": "Engineering and Information Technology",
      "job_employment_type": "Full-time",
      "job_industries": "IT Services and IT Consulting",
      "company_url": "https://in.linkedin.com/company/wipro?trk=public_jobs_topcard-org-name",
      "job_posted_time": "3 days ago",
      "job_num_applicants": 200,
      "discovery_input": {
 etc... 